{
    "sentence": [
        "Tesla’s Chief Financial Officer, Taneja Vaibhav, and the head of Tesla’s board of directors, Robyn Denholm, have just sold tens of millions of dollars worth of Tesla (TSLA) stock.",
        "Elon Musk’s brother is also selling.",
        "Public companies must report insider stock trading by critical executives and board members to the SEC.",
        "For Tesla, it’s a very limited group for a company of that size.",
        "And they are not buying the stock.",
        "In fact, they are almost exclusively selling.",
        "Today, Tesla reported two new sets of transactions in SEC filings.",
        "Chief Financial Officer Taneja Vaibhav confirmed that he sold 7,000 shares for $2,681,770.",
        "He was able to acquire those 7,000 Tesla shares at $18.22 as part of his stock option plan.",
        "He sold at an average of $383, and the stock closed at $374 today.",
        "Robyn Denholm, Tesla’s chairwoman, sold 112,390 shares at an average price of $384.04, for a total value of $43,162,255.60.",
        "She also got the shares as part of a stock option plan.",
        "Denholm had to return tens of millions of dollars worth of Tesla stocks to the company after settling a lawsuit over excessive compensation brought by shareholders.",
        "Tesla’s entire board settled for nearly $1 billion: Tesla wrote in the filings that both Vaibhav and Denholm sold as part of stock option liquidation plans adopted last year.",
        "Today, Tesla released another SEC filing to disclose that Kimbal Musk, Elon Musk’s brother and Tesla board member who also was part of the excessive compensation settlement, is selling 75,000 Tesla shares through Morgan Stanley for $27.5 million.",
        "In his case, it doesn’t appear to be linked to a liquidation plan.I don’t see any scenario ever Tesla sales grow anywhere outside of China.",
        "USA and EU are definitely on the decline for the foreseeable future.",
        "You can get a used 3 for less than 20k and there’s plenty on the market.",
        "Even if they introduced a cheaper 3/Y I don’t see that changing the trajectory this is on.",
        "The damage has been done and the cracks in the foundation are starting to be seen.",
        "Q1 is going to be bad, Q2 is going to be VERY BAD.",
        "Kimbal is known to have great “timing” with his Tesla stock sales.",
        "It will be interesting to see.",
        "It’s wild to see these board members getting absurdly rich while the company has erased its growth and is heading into one of its worst quarters in years.",
        "All while they sit on their hands and do nothing while they are the only ones who could do something about the CEO, who seemingly engages in fireable offenses every day.",
        "Tesla has one of the worst corporate governance of any major companies I’ve ever witnessed.",
        "Company likely to invest $100 billion in 2025 capital expenses.",
        "Cloud unit sales increase 19% for the third straight quarter.",
        "Amazon.com Inc. warned investors that it could face capacity constraints in its cloud computing division despite plans to invest some $100 billion this year, with most of the money going toward data centers, homegrown chips and other equipment to provide artificial intelligence services.",
        "Chief Executive Officer Andy Jassy, determined to turn Amazon into an AI supermarket, is spending big to retain the company’s edge in cloud-computing services.",
        "Still, he warned growth would be “lumpy” owing to challenges securing sufficient hardware and electricity.",
        "“It is true we could be growing faster were it not for some of the constraints on capacity,” Jassy said on a conference call Thursday after the release of fourth-quarter results.",
        "The concerns echo those of rival Microsoft Corp., which last week said its cloud sales growth was hurt because it didn’t have enough data centers to handle demand for its AI products.",
        "Jassy said power capacity and the supply of chips — from third parties and Amazon’s own design unit — are limiting the ability of Amazon Web Services to bring new data centers online.",
        "Those constraints will likely ease in the second half of 2025, he said.",
        "Amazon spent $26.3 billion in capital expenditures in the last three months of 2024, the vast majority of which went toward AI-related projects within AWS.",
        "Jassy told analysts on the call that the amount was “reasonably representative” of the rate of outlays the company planned to make in 2025.",
        "The company reported that AWS revenue jumped 19% to $28.8 billion in the quarter ended Dec.",
        "31.",
        "It was the third straight period of 19% growth for the cloud unit.",
        "“AWS growth did not accelerate as anticipated and instead matched Q3 levels, indicating that the company is challenged by the same types of capacity constraints facing rivals Google and Microsoft,” said Sky Canaves, an analyst at Emarketer.",
        "Jassy’s warning on AWS growth constraints overshadowed a fairly strong holiday quarter, suggesting the company’s main e-commerce and logistics business is fending off competition from Walmart Inc.",
        "and discount upstarts like Temu and Shein.",
        "The shares declined almost 3% as the markets opened on Friday in New York.",
        "The stock had previously gained 8.9% so far this year after a 44% jump in 2024.",
        "The AI race will likely weigh down profits.",
        "Operating income will be $14 billion to $18 billion in the period ending in March, the Seattle-based company said in a statement.",
        "Analysts, on average, projected $18.2 billion, according to data compiled by Bloomberg.",
        "First-quarter sales will be as much as $155.5 billion, compared with an average estimate of $158.6 billion.",
        "While Amazon’s overall quarter was generally positive, “investors immediate concerns are around Q1 guidance, which was below expectations, mostly because of the impact of a big currency drag and the impact of lapping a leap year,” said Gil Luria, an analyst at DA Davidson & Co.",
        "The company said the extra day in the quarter in 2024 boosted sales by about $1.5 billion.",
        "Total revenue in the holiday quarter increased 10% to $187.8 billion, slightly ahead of analyst estimates.",
        "Operating profit was $21.2 billion, compared with the average estimate of $18.8 billion.",
        "Total operating expenses rose 6.2% to $166.6 billion — marking the eighth consecutive quarter that Amazon’s revenue increased at a higher rate than costs.",
        "The company employed more than 1.55 million full- and part-time workers at the end of the quarter, a 2% increase from a year earlier.",
        "A problem I encountered when screening for the main driver of corporate performance (free cash flow) is that it tells you the amount a company is generating, but not how efficiently it generates it.",
        "This plays a role when you screen for example for protection against inflation.",
        "Ideally, you want Cash Flow and CapEx to be wide apart because then you have a capital-light business.",
        "The solution is that you divide CapEx by Cash Flow and use this number as guidance.",
        "The lower it is, the better and vice versa.",
        "As a rule of thumb I don't buy anything above 30%.",
        "Stocks who are below 10% consistently are great performers.",
        "Results from a backtest of just this single ratio among the Russell 2000 stocks for stocks whose number is below 20%: /+12.46% vs.",
        "+8.06% in the last 25 years compared to the S&P 500.",
        "(can't attach the pic in this sub) Of course you should combine it with other quantitative metrics.",
        "It confirms what most of you probably already know: Capital light businesses outperform capital heavy businesses.",
        "You can use it in your analysis.",
        "I do it and it helps me a lot and it's easy to calculate.",
        "I'm not sure if I am allowed to post the article here where I explain it in detail, but you guys know where to find it.",
        "Hovering right around it's 52 week low and going to spin off Topgolf this year.",
        "1.4 billion for both companies together seems undervalued to me.",
        "My family has owned a golf course for the past 30 years and one thing I've noticed is that no matter how bad the economy seems to be, when it's nice out, people golf.",
        "Any glaring arguments against throwing some money into this?",
        "I read yesterday the news of the Roblox getting investigated for child gambling, and other unethical things.",
        "I bought some but not a whole lot, what typically happens to the stock when it has those types of allegations?",
        "MDA Space is a Canadian company involved in the rapidly developing space industry projected to grow from 600B today to 1.8T by 2035.",
        "They are famously known for developing the Canadarm on the ISS and specialize in space robotics and the development of GEO satellites in space.",
        "CEO Mike Greenley has 25+ years experience among many top organizations in the defence and security industry notably WESCAM (L3 Harris), bringing along with him a strong foundation and vision essential for the procurement of government and commercial projects within the industry.",
        "MDA Space currently has 1/day satellite production increasing to 2/day production FY27.",
        "This puts them at roughly 400/year capacity or 2000/5 year satellite life cycle.",
        "The UK.gov, projects there to be roughly 60,000+ Satellites in space by 2035, currently sitting at just over 8000 today.",
        "This means that to reach max production capabilities, MDA Space will need to penetrate roughly 3% of the market to maximize their satellite revenue available.",
        "(Seems fairly achievable) This doesn’t include the multitude of other avenues for revenue growth, including the space robotics segments, leveraging the development of Canadarm 3 for commercial purchases (MDA Skymaker), their satellite imagery and tracking capabilities, (MDA Chorus) among other NASA project and future developments.",
        "MDA Chorus and their Radarsat capabilities are an ever evolving technology, used for tracking illegal fishing with expanded use cases… Such as tracking adversaries severing cables in the Ocean, Baltic Sea etc.",
        "Valuation : Currently MDA Space trades at a 2.67B Market Cap 3B / 210M = 14.28 EV/EBITDA (Yes, they already have 210M EBITDA and aim to maintain 20% EBITDA conversion) They’re projected to grow 30% YoY over the next several years with high revenue visibility with a 4.5B backlog.",
        "FY24 Revenue 1.05B -> 2.3B Revenue FY27 Projection 2.3B x.20 = 460M EBITDA That means at a similar valuation mid FY26-27 we’d be looking at EV/EBITDA : 6.5B / 460M = 14.13 This would just be the start with Satellite production ramping up to double.",
        "The company recently took a 30% hit due to Apple diversifying and announcing an agreement to test Starlink capabilities on their network.",
        "This came after Apple invested 1.5B in one of MDA’s customers (GlobalStar) to procure a constellation and taking a 20% stake in the company.",
        "Analysts predict this isn’t a material change since Apples investment was back in November and believe they are simply diversifying in the short term.",
        "Secondly, the tariff threat.",
        "If Trump follows through, it could create headwinds in the short term, putting further pressure on the SP.",
        "In my opinion, it’s a great opportunity to buy a successful canadian company which is rare (lol).",
        "High quality Canadian companies generally trade at higher multiples due to the rarity especially those in premium industries.",
        "Potential Tailwinds : GSAT confidence increases and Tariff threat is nullified, that will rapidly increase the SP.",
        "Winning further contracts to expand their backlog will be critical / important to watch for.",
        "MDA did say they were also looking at a Dual stock listing to increase US Investment.",
        "They will also be looking at potential M&A opportunities to penetrate the US market aiding in US Gov contracts in the future.",
        "There’s lots to be excited about, I think while there’s short term headwinds, the potential this company has is massive.",
        "Hopefully you guys enjoy this DD.",
        "Feel like the stock should at least be worth 5$/6$ if not more, theoretically 2025 is going to be their year with the new battery exchange stations and their plans to announce firefly new EVs+ expand their network of stations.",
        "Plus the CEO seems to be competent, any important data im not taking into account?",
        "Competition is the only factor that makes me not go hard on it tbh.",
        "Been researching Uber as a potential investment and wanted to share my thoughts about the risks and upside to make sure im not missing anything.",
        "Uber’s current valuation seems disconnected from its fundamentals.",
        "It trades at a P/E of ~16x 2025 earnings, lower than DoorDash (~40x) and the broader market.",
        "Free cash flow jumped to $6.9B in 2024, and analysts expect $7.7B in 2025, i think the stock hasn’t fully priced this in.",
        "There’s also optionality in hidden assets like its stakes in Waymo and Fairfax India’s Bangalore Airport, which could unlock billions if those companies go public.",
        "Management has been aggressive with buybacks ($7B program) and debt reduction, cutting net debt/EBITDA to 1.2x.",
        "They’re reinvesting in growth areas like autonomous vehicles (partnering with Waymo and Tesla) and Uber One subscriptions, which already drive 35% of gross bookings.",
        "Advertising revenue is a sleeper hit—it grew 80% last year and could hit a $5B annual run rate by 2026.",
        "Near-term catalysts include a $1.5B accelerated buyback and possible S&P 500 inclusion.",
        "Long-term, AV adoption could add $12B EBITDA by 2030.",
        "Risks?",
        "AV delays or regulatory hurdles, but at 1.2x P/B and $9B cash (~10% of market cap), downside feels capped.",
        "Upside to $115+ seems plausible if execution continues.",
        "What am I missing?",
        "Are AV partnerships overhyped, or is Uber positioning itself as the aggregator?",
        "How sustainable is the advertising growth with competition from DoorDash/Lyft?",
        "Does the cash cushion and buyback program make this a safer play in a shaky macro?",
        "Would love to hear others’ takes.",
        "Serabi Gold plc is a gold exploration and production company involved in the evaluation and development of gold deposits in Brazil.",
        "The company's primary interests are its 100% owned Palito Mining Complex and the recently acquired Coringa Gold Project both located in the Tapajos region of northern Brazil.",
        "The Company has consistently produced 30,000 to 40,000 ounces per year with the Palito Complex and is planning to double production in the coming years with the construction of the Coringa Gold project.",
        "Thor exploration.is a West African focussed gold producer listed on both the TSX Venture Exchange and AIM Market of the London Stock Exchange.Thor Explorations Ltd is a low-cost gold producer with a growing diversified Portfolio of mineral assets in west Africa, ranging from its producing Segilola mine in Nigeria, to its 1,780,000 ounce resource Douta Project in Senegal, which is currently being advanced to a prefeasibility study, and its growing grassroots lithium land package in Nigeria.",
        "Both have excellent financial and have small marketcap it should be higher if you compare to their cashflow or revenue.",
        "I prefer these two over the giant barrick gold for they have more upside and lower pe and i dont see share price  appreciation in barrick just look at their 5 yr chart.",
        "We may see price of gold around $3500 and these 2 would benefit.",
        "These would also make a good diversification from your ai and meme stocks.",
        "Basically the Mag 7 is really a Mag 1 to start the year.",
        "All stocks disappointed except Meta.",
        "Meta up 19% YTD.",
        "Strong Q4 results & strong guidance.",
        "Alphabet down 7% in the past month.",
        "Google Cloud miss & high Capex.",
        "Microsoft down 2% for the same reasons.",
        "Azure miss & high capex.",
        "TSLA down 8% with weak EV deliveries.",
        "Apple down 7% YTD.",
        "iPhone sales down 1%, China revenue down 11%, revenue growth of just 'low to mid single digits' for the upcoming quarter.",
        "NVIDIA down 6% YTD.",
        "DeepSeek's cost-effective model raises questions.",
        "Amazon down 4% after releasing earnings recently.",
        "AWS results came in lower than expected & guidance for next quarter's revenue & profit came up short.",
        "Curious what others go from here.",
        "For some long-term investors, it's a dip for a buying opportunity.",
        "Some might stay away given limited upside with DeepSeek, high Capex, and softer revenue growth.",
        "On Friday when the indexs and the broader markets were down, few stocks like SMCI, UBER and HIMS really rallied.",
        "Uber cause if Bill Ackman, SMCI cause if their upcoming earnings + 10K news, makes sense.",
        "What do you all think about HIMS rallying for the last year and what about it's future?",
        "I heard it rallied cause of t's superbowl ad.",
        "With it's upcoming earnings, what do you think is the trajectory of this stock?",
        "It's grown it's revenues for the last few quarters and looking good.",
        "I can find it's sub to ask this there but do you all have any predictions based on news or politics or company announcements?",
        "Hey redditors, I've never made any investments except for converting part of my salary to a more stable currency when I lived for several years in a country with a volatile home currency.",
        ":) And honestly I really don't feel like I am ready to dive deep into investment business domain, because I understand how complicated it is.",
        "Please don't take this as my laziness, but rather me being realistic and *respectful* to those who really mastered in this area.",
        "However, curiosity and inflation push me to try something that will give me both - profit above that from savings bank account, and understanding *what* is that world that you all guys live in.",
        ":) The first thing that comes to my mind is just to use my bank's app, which allows to buy portfolios of shares (e.g., S&P 500) or shares of specific companies.",
        "I guess the latter makes no sense if I don't study this specific company, its strategy, the market it operates on, etc.",
        "So portfolios managed by investment professionals look more safe in my case, am I right?",
        "Maybe there is one more option - use services of some investment fund and let them decide?",
        "It's a B2C thing that I mean here, i.e.",
        "several thousand $ a month, not hundreds of thousands.",
        ":) Will appreciate your comments, thank you!",
        "Whilst I understand the associated risks, I want to invest 40k in high growth stocks for short term (6 months - 1 year) gains.",
        "I am thinking something like AMD, NVIDIA, PLTR, MSFT.",
        "Or maybe I’m completely missing something else in the list for high growth potential.",
        "If you’re to take this approach today and invest 40k, what would you go for?",
        "And maybe why.",
        "Yes, you read that right.",
        "The clothing store that was popular during my time in middle school (20 years ago) has made arguably the greatest comeback in civilization.",
        "Their free cash flow last year was 400 million and they have a market cap of 5.85 billion.",
        "They have a great balance sheet and some of the best fundamentals.",
        "Check out these numbers: PE ratio: 11 Forward PE: 9.81 PEG Ratio: .54 P/FCF: 11.08 Project 2025 net income:  ($10.66EPS x 50m shares) = $533,000,000  Cash on balance Sheet: 683 million dollars  Only thing weighing them down right now is tariff threats.",
        "However, Fran Horowitz has done an incredible job after taking over the company in 2017.",
        "The rebrand and shifting in culture has been phenomenal to say the least.",
        "GME has been in a 3-4 year sell off after the 2021 squeeze.",
        "In recent months, its closed less profitable stores and sold shares diluting share holders, yet raising upwards of $5B, paying off a majority of debts, and being profitable for the first time in awhile last earnings.",
        "The company is currently valued at $11.04B.",
        "They have a CEO taking no compensation and holding stock, focusing on finding value for the shareholder.",
        "Not to mention the characters like Roaring Kitty who show up once in a blue moon to give their opinion, often bringing more volatility… Why is GME ignored by so many investors long term?",
        "Because it was labeled as a meme stock?",
        "I just don’t see how it’s continuing this sell off… Also with talks of transforming the business, and the CEO recently taking pictures with notable figures like Michael Saylor of MSTR, I feel like something is be on the horizon.",
        "I hold GME and have for a few months.",
        "If you look you can see it’s been selling off after some recent highs.",
        "Could it be oversold?",
        "Or am I missing something…",
        "I'm trying to make my own diversification of the slightly better companies in S&P 500 (doesn't necessarily need to be in S&P500).",
        "I don't really care for ESG, i find it to be a metric only for greenwashing, and blurring the nuances between companies that actually try, vs companies that just manage a facade.",
        "I understand that all companies this big have some blood on their hands to a certain degree, but i want to know which companies come out on top?",
        "E.G.",
        "i like Apple and Microsoft way better than Meta and Amazon.",
        "Some companies you find to try more than their competitors?",
        "Edit from other subreddit:  I'm not looking for the holy grail of ethics here, just the better companies relative to the others.",
        "As i said i know all these companies couldn't exactly be considered ethical.",
        "As far as what i consider ethical is metrics such as less pollution, child labor, livable wages, no imperialism etc.",
        "The very basic human rights not being totally ignored is a good start.",
        "The traditional February revision of U.S.",
        "labor market data revealed 611K fewer jobs than previously reported.",
        "However, most of this revision (400K jobs) applied to the period before 2024, while the last few months of 2024 were actually revised upward.",
        "In January, the economy officially added 143K jobs—close to neutral levels but half of December’s estimate (307K), indicating a slowdown.",
        "Over the past six months, job growth has averaged 176K per month, which is slightly above neutral levels for the economy.",
        "However, hourly wage growth accelerated in January to 0.5% month-over-month and 4.1% year-over-year, though average hours worked declined, leading to a slight drop in overall payrolls.",
        "Job openings also decreased, reaching 111% of the number of unemployed workers in December.",
        "But that’s not all—the population revision was even more dramatic: an increase of 2.87 million, with 2.11 million entering the labor force and 2 million more people classified as employed.",
        "The unemployment rate fell to 4%, labor force participation rose to 62.6%, and the employment-to-population ratio increased to 60.1%.",
        "The couple million workers missing from household surveys over the past two years have suddenly been “found.” Somehow, U.S.",
        "statisticians overlooked these numbers for two years and just now discovered them.",
        "Once again, the February labor market revision was massive.",
        "How was the population underestimated by nearly 3 million and employment by 2 million?",
        "Poor tracking of migrants—despite clear signals from immigration reports.",
        "While the current report suggests some labor market cooling, the data is highly mixed, making it unlikely to change the Fed’s current stance on holding rates steady.",
        "Redditors on other subs say this is going to kill Reddit, but Redditors are usually wrong about literally everything.",
        "Usually the opposite of whatever the general consensus is, is what actually happens.",
        "Such as how Redditors thought Netflix blocking password sharing would be its demise yet it mooned the company to new heights.",
        "Or how Reddit thought X would die yet it doubled EBITDA and advertisers are coming back.",
        "So calls on $RDDT?",
        "You think the Reddit mods are still going to work for free too?",
        "Thoughts?",
        "Consumers sharply curtailed their spending in January, indicating a potential weakening in economic growth ahead, according to a Commerce Department report Friday.",
        "Retail sales slipped 0.9% for the month from an upwardly revised 0.7% gain in December, even worse than the Dow Jones estimate for a 0.2% decline.",
        "The sales totals are adjusted for seasonality but not inflation for a month in which prices rose 0.5%.",
        "Excluding autos, prices fell 0.4%, also well off the consensus forecast for a 0.3% increase.",
        "A “control” measure that strips out several nonessential categories and figures directly into calculations for gross domestic product fell 0.8% after an upwardly revised increase of 0.8%.",
        "With consumer spending making up about two-thirds of all economic activity in the U.S., the sales numbers indicate a potential weakening in growth for the first quarter.",
        "Receipts at sporting goods, music and book stores tumbled 4.6% on the month, while online outlets reported a 1.9% decline and motor vehicles and parts spending dropped 2.8%.",
        "Gas stations along with food and drinking establishments both reported 0.9% increases.",
        "Earnings: Loss of $2.36 per share.",
        "Revenue: $3.6 million.",
        "The company's revenue declined 12% year over year, according to its annual report.",
        "The company saw its net loss widen to $400.9 million from $58.2 million in 2023.",
        "This company has an almost $7 Billion market cap.",
        "WYF",
        "Taiwan Semiconductor Manufacturing Co.",
        "is considering taking a controlling stake in Intel Corp.’s factories at the request of Trump administration officials, a person familiar with the matter said, as the president looks to boost American manufacturing and maintain US leadership in critical technologies.",
        "Trump’s team raised the idea of a deal between the two companies in recent meetings with officials from the Taiwanese chipmaker, the person said, and TSMC was receptive.",
        "It’s unclear whether Intel is open to a transaction.",
        "The talks are in very early stages, and the exact structure of a potential partnership hasn’t been established.",
        "But the intended result would have the world’s largest made-to-order chipmaker fully operating Intel’s US semiconductor factories, said the person, who asked not to be identified because the conversations are private.",
        "It also would address concerns about Intel’s deteriorating financial state, which has forced the company to slash jobs and curb its global expansion plans.",
        "The arrangement may involve having major American chip designers take equity stakes, according to the person, along with support from the US government.",
        "That means the venture wouldn’t solely be owned by a foreign company.",
        "TSMC is the go-to chipmaker for Apple Inc., Nvidia Corp.",
        "and other companies developing semiconductors that power AI algorithms.",
        "TSMC and Santa Clara, California-based Intel declined to comment.",
        "A White House representative didn’t immediately respond to a request for comment.",
        "Intel shares pared losses on Friday after Bloomberg reported on the discussions.",
        "The stock was down less than 1% to $24 as 1:56 p.m.",
        "in New York after dropping as much as 5.3% earlier in the session.",
        "While Intel has lost a lot of ground to rivals over the last five years, it still manufactures the most widely used components in the personal computer and server industries.",
        "And it has the largest and most advanced production network owned by a US-based company.",
        "Those factories have taken on vital strategic importance as Washington works to reverse decades of semiconductor manufacturing shifting to Asia.",
        "Under former Chief Executive Officer Pat Gelsinger, Intel embarked on an ambitious and expensive plan to restore its chipmaking lead, and the company won $7.9 billion in US government funding to support projects in four states.",
        "It’s also secured $3 billion to produce chips for the US military, all of which will be paid out over time as Intel’s plants hit key milestones.",
        "The company has received $2.2 billion as of January.",
        "But that effort has so far failed to attract enough outside customers to make the investments worthwhile, particularly at a new site in Ohio.",
        "Intel’s own products also are losing market share, adding to the overall squeeze on its finances — just when it needs to spend heavily.",
        "Gelsinger was forced out in December after the board lost confidence in his turnaround plans.",
        "Though Intel has reiterated its commitment to investing in US factories — even as it pulls back from efforts abroad — Washington officials have for months been discussing contingency plans.",
        "One option favored by some in the Biden administration was a possible deal between Intel and GlobalFoundries Inc., Bloomberg has reported.",
        "That would have married a maker of older-generation chips with Intel’s leading-edge business.",
        "But GlobalFoundries walked away from cutting-edge production years ago and doesn’t have the money for an acquisition, so those conversations didn’t progress much past a thought exercise.",
        "Biden officials also floated the possibility of TSMC licensing its manufacturing technology for use at Intel’s facilities, according to multiple people familiar with the conversations.",
        "But TSMC wasn’t interested in an arrangement that could ultimately benefit a competitor, the people said.",
        "And Biden’s team was generally reluctant to take an active role in deal conversations, according to several people familiar with the situation.",
        "Trump, meanwhile, is not shy about cutting deals — and TSMC, which just held its board meeting in the US for the first time, is eager to maintain good relations with the new president.",
        "Trump has repeatedly accused Taiwan of “stealing” the US chip industry and threatened tariffs on foreign-produced semiconductors.",
        "He’s expressed a preference for using those kinds of levies to boost US chipmaking instead of government subsidies — the approach adopted by the US Chips and Science Act.",
        "That legislation, passed in 2022, led to TSMC winning $6.6 billion in grants to support three plants in Phoenix.",
        "But it was also Trump’s first administration that set out to lure TSMC to the US, and top Trump officials have consistently affirmed their commitment to boosting domestic manufacturing.",
        "That’s particularly true for technologies at the heart of the US-China competition.",
        "The US “will ensure that the most powerful AI systems are built in the US with American-designed and manufactured chips,” Vice President JD Vance said during an AI summit in Paris earlier this week.",
        "The fact that TSMC is open to an Intel deal indicates a change in tune from just a few months ago.",
        "In October, CEO C.C.",
        "Wei had told analysts that his company wasn’t interested in acquiring Intel’s factories.",
        "Asked the same question again in January, Wei didn’t directly answer: “They are our very good customers,” he said.",
        "“I like them and they are very important to TSMC’s business also.",
        "That all I can say.”",
        "Dell shares jumped to a session high on Friday following a report saying Elon Musk’s startup xAI was getting ready to agree to buy $5 billion in artificial intelligence servers from the hardware maker.",
        "The equipment containing Nvidia’s GB200 graphics processing units would be delivered this year, according to Bloomberg, which cited unnamed sources.",
        "Many data center gear manufacturers have been seeing growth from selling boxes for training and running AI models.",
        "Dell said in November that it had $3.6 billion in quarterly AI server order demand.",
        "Dell’s total revenue for the quarter ended Nov.",
        "1 totaled $24.37 billion, up 10% year over year.",
        "In December xAI announced a $6 billion funding round.",
        "CNBC reported that the Musk startup was raising the money to purchase GPUs.",
        "The Grok assistant from xAI is available for people to use on the Musk-owned social network X.",
        "Last summer Musk said Nvidia, X and xAI had contributed to the getting a data center filled with GPUs online in Memphis, Tennessee.",
        "Meta Platforms Inc., after pushing into augmented reality and artificial intelligence, has identified its next big bet: AI-powered humanoid robots.",
        "The company is making a significant investment into the category — futuristic robots that can act like humans and assist with physical tasks — and is forming a new team within its Reality Labs hardware division to conduct the work, according to people with knowledge of the matter.",
        "Meta plans to work on its own humanoid robot hardware, with an initial focus on household chores.",
        "Its bigger ambition is to make the underlying AI, sensors and software for robots that will be manufactured and sold by a range of companies, said the people, who asked not to be identified because the initiative hasn’t been announced.",
        "Meta has started discussing its plan with robotics companies, including Unitree Robotics and Figure AI Inc.",
        "At least initially, it doesn’t plan to build a Meta-branded robot — something that could directly rival Tesla Inc.’s Optimus — but it may consider doing so in the future, the people added.",
        "The humanoid effort mirrors exploratory projects at other technology giants, including Apple Inc.",
        "and Alphabet Inc.’s Google Deepmind division.",
        "A Meta spokesperson declined to comment.",
        "Meta confirmed the creation of the new team to employees Friday, telling them it will be led by Marc Whitten, who resigned as chief executive officer of General Motors Co.’s Cruise self-driving car division earlier this month.",
        "He was previously an executive at gaming company Unity Software Inc.",
        "and Amazon.com Inc.",
        "“The core technologies we’ve already invested in and built across Reality Labs and AI are complementary to developing the advancements needed for robotics,” Andrew Bosworth, Meta’s chief technology officer, wrote in a memo reviewed by Bloomberg News.",
        "He mentioned the company’s advancements in hand tracking, computing at low bandwidth and always-on sensors.",
        "Meta executives believe that while humanoid robotics companies have made headway in hardware, Meta’s advances in artificial intelligence and data collected from augmented and virtual reality devices could accelerate progress in the nascent industry.",
        "Current humanoids are still not useful enough to fold clothes, carry a glass of water, place dishes in a rack for cleaning or conduct other home chores that could get consumers interested in the category.",
        "“We believe that expanding our portfolio to invest in this field will only accrue value to Meta AI and our mixed and augmented reality programs,” Bosworth wrote.",
        "Whitten, who will report to Bosworth, will have headcount to hire around 100 engineers this year, one of the people said.",
        "Meta’s goal is to provide what Google’s Android operating system and Qualcomm Inc.’s chips did for the phone industry by building a foundation for the rest of the market.",
        "The software, sensors and computing packages that Meta is already developing for its devices are the same technologies that are needed to power humanoids, according to one of the people involved in the project.",
        "Meta has been investing billions of dollars for years into its Reality Labs hardware division, which sells products like the Quest VR headset and the increasingly popular Ray-Ban smart glasses.",
        "Meta plans to spend $65 billion this year on related products, including artificial intelligence infrastructure and the new robot work.",
        "Barrick Gold Corp.",
        "ABX-T is considering redomiciling to the United States from Canada, and under a Donald Trump administration that could happen sooner rather than later, Barrick chief executive Mark Bristow told The Globe and Mail’s editorial board.",
        "On Thursday, he mapped out several reasons why a move to the U.S.",
        "makes sense, including access to a more efficient marketplace, and the ability to attract a bigger pool of shareholders.",
        "Redomiciling to the U.S.",
        "could put Barrick in the S&P 500 index, which would attract automatic buying from scores of mutual funds and exchange traded funds that track indexes.",
        "Colorado-based Newmont Corp.",
        "is the only gold mining company in the S&P 500.",
        "I bought some crowd strike when they crashed in July/August in the outage, and I’m up like 70% on it right now, but with a P/E ratio of 900, what makes analysts think this is a bullish stock?",
        "I understand crowd strike is primarily a growth stock so it’s P/E is a little bit misleading, but I feel it is definitely overvalued, however I think it will continue to to up regardless.",
        "What are some indicators or signs that this stock is bullish?",
        "Is it just hype or is there something behind it?",
        "Most of my portfolio is held in ETF’s/Mutual funds, but I got relatively lucky with a stock.",
        "I’m up around 200% on short term gains, but it’s a company I want to keep investing in.",
        "I saw Kevin O’Leary say in an interview he will realize gains to “lock in his gains,” does that actually make any sense?",
        "Edit: a lot of good advice in the comments that I really appreciate!",
        "Thank you guys.",
        "I think I’m holding the course for now.",
        "Just looking at Novo and now Eli Lilly bordering on going down.",
        "Why Healthcare Stocks Will Face Pressure Now & in the Near Future: 1.",
        "Federal Funding Cuts - Reduced government support for medical research and drug development will hurt pharmaceutical and biotech companies.",
        "(Trump administration) 2.",
        "Regulatory & Policy Risks - Possible stricter price controls and budget cuts in healthcare sectors, especially with political shifts.",
        "3.",
        "Earnings & Growth Concerns - Major healthcare companies (e.g., Biogen, Merck) have reported disappointing earnings and weak future outlooks.",
        "4.",
        "Sector Underperformance - Healthcare stocks lagged behind the S&P 500 in 2024 and may continue to struggle as investors shift toward tech and Al.",
        "I could be wrong.",
        "What do you think?",
        "📈 HIMS: 32.94% Short Interest & Earnings on Feb 24 – Squeeze Incoming?",
        "Hims & Hers Health (NYSE: HIMS) has been on an absolute tear lately, closing at $59.18 after a 27% single-day gain.",
        "But what’s really catching my attention is the massive short interest—32.94% of the float is shorted.",
        "With earnings coming up on February 24, could we be looking at a potential short squeeze?",
        "🔍 The Setup: Why HIMS Could See More Upside •Short Interest: 32.94% of the float is short—this is extremely high.",
        "•Days to Cover: 3.7 days—If a squeeze happens, it could escalate fast.",
        "•Momentum is Strong: +27% in a single day means the stock is already attracting buyers.",
        "•Earnings on Feb 24: If HIMS beats expectations, shorts could be forced to cover, accelerating an upward move.",
        "This stock has the classic setup for a major move higher if catalysts align.",
        "🛑 Why Are Shorts Betting Against HIMS?",
        "1️⃣ Valuation Concerns – After a big rally, some believe HIMS is overvalued.",
        "2️⃣ Profitability Questions – While revenue growth is strong, it’s still working toward sustained profitability.",
        "3️⃣ Competition – Giants like Amazon and Teladoc are expanding in the space.",
        "4️⃣ Recent Run-Up – Some traders may be expecting a pullback after the massive surge.",
        "However, these same shorts could be fuel for a squeeze if sentiment stays bullish.",
        "🔥 Bullish Case: Could HIMS Hit $100?",
        "🚀 Shorts Are Stuck – If earnings beat expectations, covering could push the stock much higher.",
        "🚀 Retail Interest Is Growing – Increased trading volume could indicate more retail momentum.",
        "🚀 Breakout Levels – If HIMS clears $65-$70, technical traders could pile in.",
        "🚀 Telehealth Growth – Long-term, HIMS is expanding its subscription model and increasing its customer base.",
        "💰 My Position & Dilemma I currently hold 1,000 shares and am up $52K from an initial $8K investment.",
        "Now, I’m debating my next move: 1️⃣ Hold for the potential squeeze?",
        "2️⃣ Take some profits before earnings and reduce risk?",
        "3️⃣ Reinvest into call options for higher leverage?",
        "📊 Final Thoughts – What’s Next for HIMS?",
        "HIMS is one of the highest shorted stocks in the market, has earnings as a major catalyst, and has strong momentum going into the event.",
        "If the company delivers strong guidance and beats earnings, we could see $80+ or even $100 in the coming weeks.",
        "💡 What are your thoughts?",
        "Are we looking at a real short squeeze setup, or is it time to take profits before earnings?",
        "Okay so this price movement today has me baffled.",
        "The company absolutely slayed earnings and it tumbled pretty hard.",
        "The new administration is more friendly towards crypto and bitcoin is becoming more mainstream.",
        "Some people say Robinhood is taking crypto market share from coinbase, but I had always felt the bigger crypto buyers used actual exchanges like coinbase.",
        "What’s your outlook on this stock?",
        "Will SMCI file 10K by 25,what are yall opinion.",
        "If yes what will be the after-effects and if no what will happen.",
        "SMCI being the main player on the AI data centre genre.And with US government to spend around 500B USD on AI and its development,especially with all the magnificent seven also spending around 100B what will the future of SMCI look like.",
        "Hey everyone!",
        "I need some assistance with identifying the best method of shifting my stocks from Platform A (redacted) to IBKR.",
        "When I initially started out with platform A, it had zero fees, and was promoted as an option for new investors and traders.",
        "It has a very simple User Interface, and a large variety of Stocks, ETFs, Cryptos etc.",
        "Recently they have started charging $1 per trade, and through some research I found out that they use IBKR on the back-end, which has significantly lower fees.",
        "Now my portfolio on Platform A has mostly long-term growth stocks that I am holding, and maybe 2-3 short-term stocks.",
        "Most of these are currently at a decent profit.",
        "Should I sell all my holdings on Platform A and buy them back on IBKR ?",
        "Or Should I keep my short-term stocks on Platform A and slowly transition the rest into IBKR ?",
        "PS: I am not a very experienced trader/investor, and I apologize if any terminologies are wrong.",
        "From a cursory search it seems exchanges have discretionary authority related to public interest.",
        "From NASDAQ delisting criteria: 'Staff has determined, under its discretionary authority in the Rule 5100 Series, that the Company's continued listing raises a public interest concern.' I am curious about effects on market cap for both the delisted company and exchange, company behavior, and time to relisting on the same or different exchange.",
        "Thank you.",
        "CDPR continues to go up since last post.",
        "CDPR went very significantly up after their lows around 80PLN to their normal levels around 225.",
        "On their roadmap there are two huge projects: Witcher 4 and another Cyberpunk - Orion.",
        "Recently they stopped working on their own engine and moved to Unreal.",
        "This should decrease development cost, make roadmap more predictable and make it easier to onboard new employees.",
        "Also they acquired The Molasses Flood - experienced, Boston based game studio.",
        "They are also good at pushing their IPs outside e.g Edge Runners series Witcher 4 has been in development for years and is expected (even by cdpr) to appear around 2027",
        "No one is talking about this so let’s discuss.",
        "Coin had a good run up day before earning reports.",
        "They had a good earning but stock tanked.",
        "The next S&P 500 inclusion will happen on 21st March.",
        "We have seen what happens when they rebalance and add stocks like palantir..",
        "I’m convinced coinbase will be the next candidate to be included next month.",
        "Posting here for a sanity check and blind spot.",
        "Tell me why it should not be included.",
        "Criteria for Inclusion in the S&P 500 A company must meet the following criteria to be selected by the Index Committee and be included in the S&P 500 index: The company should be from the U.S.",
        "Its market cap must be at least $18 billion.",
        "Coin have more than 50 billion market cap  Its shares must be highly liquid.",
        "Coin have 10-20 million shares in average trading volume At least 10% of its outstanding shares must be available for public trading.",
        "Coinbase public float is around 20-30% It must report positive earnings in the most recent quarter.",
        "The sum of its earnings in the previous four quarters must be positive.",
        "Let’s discuss!",
        "I still remember my bank 'advisor' saying I should put money in a High Yield Savings Account because the rates are 'great' right now.",
        "I would have lost on TWO 20%+ year of S&P500 gains..lol chasing marginally high interest.",
        "Buy low sell high.",
        "I’ll start COST, NTDOY, AXP.",
        "Nintendo is very much against AI and it has nothing to do with any part of their business.",
        "Their 1st party games are made by pure human talent, and the IP is top of line when it comes to entertainment.",
        "American Express wouldn’t be affected as it doesn’t need any AI investment to pay off for it to make revenue.",
        "They still rake in cash from their credit business and their cards are still popular among younger people because of the status of having one.",
        "Costco is Costco, their valuation might be high but it’s one of the highest quality businesses in the world.",
        "If everyone flocks to buying gold it looks like Costco will end up being the beneficiary.",
        "HOOD reported a significant increase in EPS over the last quarter, beating estimates with a surprise 99% (1.01 vs .52 expected).",
        "Their net income increased more than 10x you, which is absurd.",
        "Average revenue per user also increased 102% yoy.",
        "The company just became profitable.",
        "Is it normal to become THAT profitable so suddenly?",
        "Benjiman Graham warns against suspicious accounting activities that can make institutions suddenly very profitable despite doing poorly in the past.",
        "I realize that Robinhood is growing rapidly but I'm concerned that there's a footnote I'm missing somewhere that showed a change in how they're categorizing or counting some asset or liability.",
        "MacD and RSI show it's priced at an extreme premium at the moment thanks to momentum, so perhaps I'm being subconsciously influenced by the stock price increase rather than the fundamentals...?",
        "Was it a one-time exceptional quarter?",
        "Any insights?",
        "Is it worth it to buy stocks of a company if the stock price is usually stable and no significant price growth can be expected within 5 years?",
        "Yes, the trends is for the price to grow, but it may take 5 years to go, for example, from $50 to $52.",
        "My point is, I want to eventually reach a point where I make around $6,000 a year in dividends from a single company that offers 3,5-4% dividends.",
        "The company in question is Shell.",
        "The company has diversified investments and is future-proof, stable and well established, so there is no risk of bankruptcy under normal market conditions.",
        "The risk I'm taking, is that dividends could be cut, and there won't be any money coming to me because the stock price grows very slowly.",
        "So, under normal market conditions, in the absence of global pandemics, wars and disruptive events, what could make Shell cut dividends?",
        "What usually makes a company to cut dividends under normal market conditions while there is good profitability?",
        "Also, if you think Shell is not a good option, you can recommend me a better company.",
        "I'm in the EU, so better recommend me EU-based companies because the US has a witholding tax for foreign investors.",
        "Thanks."
    ],
    "sentiment": [
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Positive",
        "Negative",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Negative",
        "Neutral",
        "Neutral",
        "Negative",
        "Neutral",
        "Neutral",
        "Negative",
        "Positive",
        "Positive",
        "Negative",
        "Neutral",
        "Negative",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Negative",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Negative",
        "Positive",
        "Positive",
        "Positive",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Negative",
        "Positive",
        "Neutral",
        "Positive",
        "Negative",
        "Positive",
        "Neutral",
        "Negative",
        "Neutral",
        "Negative",
        "Negative",
        "Neutral",
        "Positive",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Negative",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Negative",
        "Positive",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Negative",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Negative",
        "Neutral",
        "Neutral",
        "Negative",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Positive",
        "Positive",
        "Neutral",
        "Positive",
        "Positive",
        "Negative",
        "Neutral",
        "Positive",
        "Negative",
        "Positive",
        "Neutral",
        "Positive",
        "Negative",
        "Negative",
        "Neutral",
        "Negative",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Positive",
        "Negative",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Positive",
        "Positive",
        "Positive",
        "Negative",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Negative",
        "Neutral",
        "Neutral",
        "Negative",
        "Positive",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Positive",
        "Positive",
        "Positive",
        "Neutral",
        "Positive",
        "Neutral",
        "Negative",
        "Neutral",
        "Negative",
        "Negative",
        "Negative",
        "Negative",
        "Positive",
        "Positive",
        "Negative",
        "Neutral",
        "Neutral",
        "Neutral",
        "Negative",
        "Neutral",
        "Negative",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Negative",
        "Positive",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Negative",
        "Neutral",
        "Negative",
        "Neutral",
        "Negative",
        "Neutral",
        "Neutral",
        "Neutral",
        "Negative",
        "Positive",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Negative",
        "Neutral",
        "Positive",
        "Positive",
        "Negative",
        "Positive",
        "Positive",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Positive",
        "Positive",
        "Positive",
        "Positive",
        "Neutral",
        "Neutral",
        "Positive",
        "Positive",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Negative",
        "Neutral",
        "Positive",
        "Positive",
        "Negative",
        "Positive",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Negative",
        "Neutral",
        "Neutral",
        "Positive",
        "Negative",
        "Neutral",
        "Neutral",
        "Neutral",
        "Negative",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Negative",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Negative",
        "Positive",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Negative",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Negative",
        "Neutral",
        "Negative",
        "Negative",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Positive",
        "Positive",
        "Negative",
        "Positive",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Positive",
        "Neutral",
        "Negative",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Positive",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Positive",
        "Positive",
        "Positive",
        "Neutral",
        "Negative",
        "Negative",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Positive",
        "Positive",
        "Positive",
        "Positive",
        "Positive",
        "Neutral",
        "Positive",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Negative",
        "Neutral",
        "Neutral",
        "Negative",
        "Positive",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Positive",
        "Positive",
        "Neutral",
        "Neutral",
        "Positive",
        "Positive",
        "Neutral",
        "Positive",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Negative",
        "Neutral",
        "Neutral",
        "Negative",
        "Negative",
        "Neutral",
        "Positive",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Neutral",
        "Positive",
        "Negative",
        "Neutral",
        "Positive",
        "Neutral",
        "Positive",
        "Positive"
    ]
}